app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create!(params[:comment])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2011-10-30 17:16:28.806023', E'heowhioewhcfeow fupw ufepw uep uewop', '2011-10-30 17:16:28.806023', NULL) RETURNING "id"