app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2011-10-30 15:54:26.829812', E'test', E'test', '2011-10-30 15:54:26.829812') RETURNING "id"

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2011-10-30 15:54:41.093133', "title" = E'test1', "body" = E'test1' WHERE "id" = 1